# IST340 - Final Project: Evaluating Risk Factors of Student Loan Borrowers

## Essential Libraries

In [1]:
import pandas as pd
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

import numpy as np

import re

import warnings
warnings.filterwarnings("ignore")

In [2]:
# Define file path
file_path = './data/'

## Reading Excel Files into DataFrame

In [3]:
family_income = pd.read_excel(file_path + "Family_Income.xlsx")
family_income.head()

   STUDENT_ID  Family_Income
0           1      109770.95
1           2       58442.99
2           3       97125.87
3           4       55256.40
4           5       58187.16

In [4]:
credit_rating = pd.read_excel(file_path + "CreditRating Data 2012.xlsx")
credit_rating.head()

   STUDENT_ID  Credit_Score_Raw  Credit_Score_AgeAdj
0           1          0.495227             0.767967
1           2          0.987649             0.529815
2           3          0.249315             0.589539
3           4          0.653183             0.805702
4           5          0.273099             0.415433

In [5]:
hs_academics = pd.read_excel(file_path + "HS_Academics 2012.xlsx")
hs_academics.head()

   STUDENT_ID  HS_Math  HS_Science  HS_English
0           1       10          10        10.0
1           2        9           9        10.0
2           3        9           6         6.0
3           4       10           9         9.0
4           5        6           8         5.0

In [6]:
loan_amount = pd.read_excel(file_path + "LoanAmount.xlsx")
loan_amount.head()

   STUDENT_ID  Loan_Amount
0           1        19861
1           2        17391
2           3         8118
3           4        18905
4           5        16175

In [7]:
parents_education = pd.read_excel(file_path + "Parents_Education.xlsx")
parents_education.head()

   STUDENT_ID PARENTS_EDUCATION_LEVEL
0           1              Bachelor's
1           2               Doctorate
2           3             HS or Lower
3           4                Master's
4           5                Master's

In [8]:
personality_characteristics = pd.read_excel(file_path + "Personality Characteristics Data.xlsx")
personality_characteristics.head()

,STUDENT_ID,LongTermPlannerScore,DecisionStyle,PowerOrientedScore,CommunityOrientedScore
0,1,0.956004,Emotional,0.767967,0.189491
1,2,0.601589,Analytical,1.000000,0.529815
2,3,0.655254,Emotional,0.589539,0.589539
3,4,0.841278,Emotional,0.805702,0.061538
4,5,0.738851,Emotional,0.415433,0.241257

In [9]:
region__marital_status = pd.read_excel(file_path + "Region, Marital Status.xlsx")
region__marital_status.head()

   STUDENT_ID Country  Region  Married
0           1     USA       2        1
1           2     USA       5        0
2           3     USA       2        1
3           4     USA       1        0
4           5     USA       3        0

## Parsing Prolog-Style .pl Files into DataFrame

### enlist.pl

In [10]:
# Read the enlist.pl file line by line
with open(file_path + "enlist.pl", 'r') as file:
    lines = file.readlines()

# Let's take a look at the file (first 5 rows)
for line in lines[:5]: # Print the first 5 rows
    print(line)

% enlist(student,Service).

% student is enlisted in Service.



enlist(student40,fire_department).

enlist(student51,fire_department).

In [11]:
# Extract student number and service
data = []
for line in lines: # for each row
    match = re.match(r'enlist\(student(\d+),(\w+)\)\.', line.strip())
    if match:
        student_number = int(match.group(1)) # Extract the student ID and convert to integer
        service = match.group(2)             # the text after the comma
        data.append((student_number, service))


# Convert to DataFrame
enlist = pd.DataFrame(data, columns=['STUDENT_ID', 'Service'])
enlist.head()

   STUDENT_ID          Service
0          40  fire_department
1          51  fire_department
2         109  fire_department
3         139  fire_department
4         148  fire_department

### disabled.pl

In [12]:
# Read the disabled.pl file line by line
with open(file_path + "disabled.pl", 'r') as file:
    lines = file.readlines()

# Let's take a look at the file (first 5 rows)
for line in lines[:5]: # Print the first 5 rows
    print(line)

disabled(student992).

disabled(student976).

disabled(student963).

disabled(student918).

disabled(student913).

In [13]:
# Extract student number and disabled status
data = []
for line in lines: # for each row
    match = re.match(r'disabled\(student(\d+)\)\.', line.strip())
    if match:
        student_number = int(match.group(1)) # Extract the student ID and convert to integer
        disabled_status = bool(match.group(0))
        data.append((student_number, disabled_status))


# Convert to DataFrame
disabled_df = pd.DataFrame(data, columns=['STUDENT_ID', 'Disabled'])
disabled_df.head()

   STUDENT_ID  Disabled
0         992      True
1         976      True
2         963      True
3         918      True
4         913      True

### enrolled.pl

In [14]:
# Read the enrolled.pl file line by line
with open(file_path + "enrolled.pl", 'r') as file:
    lines = file.readlines()

# Let's take a look at the file (first 5 rows)
for line in lines[:5]: # Print the first 5 rows
    print(line)

% enrolled(Student,School,Units).

% Student is enrolled for Units at School



enrolled(student10,ucb,2).

enrolled(student18,ucsd,4).

In [15]:
# Extract student number and enrolled status
data = []
for line in lines: # for each row
    match = re.match(r'enrolled\(student(\d+),(\w+),(\w+)\)\.', line.strip())
    if match:
        student_number = int(match.group(1)) # Extract the student ID and convert to integer
        school = match.group(2)
        course_units = match.group(3)
        data.append((student_number, school, course_units))


# Convert to DataFrame
enrolled_df = pd.DataFrame(data, columns=['STUDENT_ID', 'School', 'Course Units'])
enrolled_df.head()

   STUDENT_ID School Course Units
0          10    ucb            2
1          18   ucsd            4
2          20   ucsd            3
3          35   ucsd            4
4          44   ucsd            1

### filed_for_bankruptcy.pl

In [16]:
# Read the filed_for_bankruptcy.pl file line by line
with open(file_path + "filed_for_bankruptcy.pl", 'r') as file:
    lines = file.readlines()

# Let's take a look at the file (first 5 rows)
for line in lines[:5]: # Print the first 5 rows
    print(line)

filed_for_bankrupcy(student999).

filed_for_bankrupcy(student998).

filed_for_bankrupcy(student958).

filed_for_bankrupcy(student956).

filed_for_bankrupcy(student953).

In [17]:
# Extract student number and bankruptcy status
data = []
for line in lines: # for each row
    match = re.match(r'filed_for_bankrupcy\(student(\d+)\)\.', line.strip())
    if match:
        student_number = int(match.group(1)) # Extract the student ID and convert to integer
        bankruptcy_status = bool(match.group(0))
        data.append((student_number, bankruptcy_status))


# Convert to DataFrame
bankruptcy_df = pd.DataFrame(data, columns=['STUDENT_ID', 'Bankrupted'])
bankruptcy_df.head()

   STUDENT_ID  Bankrupted
0         999        True
1         998        True
2         958        True
3         956        True
4         953        True

### male.pl

In [18]:
# Read the male.pl file line by line
with open(file_path + "male.pl", 'r') as file:
    lines = file.readlines()

# Let's take a look at the file (first 5 rows)
for line in lines[:5]: # Print the first 5 rows
    print(line)

male(student997).

male(student994).

male(student992).

male(student987).

male(student986).

In [19]:
# Extract student number and male status
data = []
for line in lines: # for each row
    match = re.match(r'male\(student(\d+)\)\.', line.strip())
    if match:
        student_number = int(match.group(1)) # Extract the student ID and convert to integer
        male_status = bool(match.group(0))
        data.append((student_number, male_status))


# Convert to DataFrame
male_df = pd.DataFrame(data, columns=['STUDENT_ID', 'Male'])
male_df.head()

   STUDENT_ID  Male
0         997  True
1         994  True
2         992  True
3         987  True
4         986  True

### unemployed.pl

In [20]:
# Read the unemployed.pl file line by line
with open(file_path + "unemployed.pl", 'r') as file:
    lines = file.readlines()

# Let's take a look at the file (first 5 rows)
for line in lines[:5]: # Print the first 5 rows
    print(line)

unemployed(student1000).

unemployed(student996).

unemployed(student993).

unemployed(student948).

unemployed(student946).

In [21]:
# Extract student number and unemployed status
data = []
for line in lines: # for each row
    match = re.match(r'unemployed\(student(\d+)\)\.', line.strip())
    if match:
        student_number = int(match.group(1)) # Extract the student ID and convert to integer
        unemployed_status = bool(match.group(0))
        data.append((student_number, unemployed_status))


# Convert to DataFrame
unemployed_df = pd.DataFrame(data, columns=['STUDENT_ID', 'Unemployed'])
unemployed_df.head()

   STUDENT_ID  Unemployed
0        1000        True
1         996        True
2         993        True
3         948        True
4         946        True

### Parsing of Similarly Formatted Files

In [22]:
# Creation of a Reusable Parsing Function
def parse_prolog_file(file_name):
    """
    Parses a .pl Prolog-like file and returns a DataFrame with:
    - Function (e.g., 'enlist', 'no_payment_due')
    - StudentNumber (e.g., 1000)
    - Label (e.g., 'fire_department', 'pos', 'neg')
    """
    pattern = r'(\w+)\(student(\d+),(\w+)\)\.'

    parsed_data = []
    with open(file_path + file_name, 'r') as f:
        for line in f:
            match = re.match(pattern, line.strip())
            if match:
                function_name = match.group(1)
                student_number = int(match.group(2))
                label = match.group(3)
                parsed_data.append((student_number, label))

    return pd.DataFrame(parsed_data, columns=['STUDENT_ID', function_name])

In [23]:
enlist_df = parse_prolog_file("enlist.pl")
enlist_df.head()

   STUDENT_ID           enlist
0          40  fire_department
1          51  fire_department
2         109  fire_department
3         139  fire_department
4         148  fire_department

In [24]:
nopaymentdue = parse_prolog_file("no_payment_due.pl")
nopaymentdue.head()

   STUDENT_ID no_payment_due
0        1000            pos
1         999            pos
2         998            pos
3         996            pos
4         994            pos

In [25]:
longest_absence_from_school_df = parse_prolog_file("longest_absense_from_school.pl")
longest_absence_from_school_df.head()

   STUDENT_ID longest_absense_from_school
0        1000                           7
1         999                           4
2         998                           1
3         997                           8
4         996                           7

## Merging of All DataFrames

In [26]:
# Check row count of dataframes

print(len(enrolled_df))
print(len(family_income))
print(len(credit_rating))
print(len(hs_academics))
print(len(loan_amount))
print(len(parents_education))
print(len(personality_characteristics))
print(len(region__marital_status))
print(len(longest_absence_from_school_df))
print(len(nopaymentdue))
print(len(male_df))
print(len(enlist_df))
print(len(unemployed_df))
print(len(bankruptcy_df))
print(len(disabled_df))

1194
1000
1000
1000
1000
1000
1000
1000
1000
1000
497
306
98
96
95

In [27]:
# Merge family_income with credit_rating

merged_df = pd.merge(family_income, credit_rating, on='STUDENT_ID', how='left')
merged_df.head()

   STUDENT_ID  Family_Income  Credit_Score_Raw  Credit_Score_AgeAdj
0           1      109770.95          0.495227             0.767967
1           2       58442.99          0.987649             0.529815
2           3       97125.87          0.249315             0.589539
3           4       55256.40          0.653183             0.805702
4           5       58187.16          0.273099             0.415433

In [28]:
# Merge combined dataframe with region__marital_status

merged_df = pd.merge(merged_df, region__marital_status, on='STUDENT_ID', how='left')
merged_df.head()

,STUDENT_ID,Family_Income,Credit_Score_Raw,Credit_Score_AgeAdj,Country,Region,Married
0,1,109770.95,0.495227,0.767967,USA,2,1
1,2,58442.99,0.987649,0.529815,USA,5,0
2,3,97125.87,0.249315,0.589539,USA,2,1
3,4,55256.40,0.653183,0.805702,USA,1,0
4,5,58187.16,0.273099,0.415433,USA,3,0

In [29]:
# Merge combined dataframe with enlist_df

merged_df = pd.merge(merged_df, enlist_df, on='STUDENT_ID', how='left')
merged_df.head()

,STUDENT_ID,Family_Income,Credit_Score_Raw,Credit_Score_AgeAdj,Country,Region,Married,enlist
0,1,109770.95,0.495227,0.767967,USA,2,1,NaN
1,2,58442.99,0.987649,0.529815,USA,5,0,NaN
2,3,97125.87,0.249315,0.589539,USA,2,1,NaN
3,4,55256.40,0.653183,0.805702,USA,1,0,marines
4,5,58187.16,0.273099,0.415433,USA,3,0,NaN

In [30]:
# Merge combined dataframe with unemployed_df

merged_df = pd.merge(merged_df, unemployed_df, on='STUDENT_ID', how='left')
merged_df.head()

,STUDENT_ID,Family_Income,Credit_Score_Raw,Credit_Score_AgeAdj,Country,Region,Married,enlist,Unemployed
0,1,109770.95,0.495227,0.767967,USA,2,1,NaN,NaN
1,2,58442.99,0.987649,0.529815,USA,5,0,NaN,NaN
2,3,97125.87,0.249315,0.589539,USA,2,1,NaN,NaN
3,4,55256.40,0.653183,0.805702,USA,1,0,marines,NaN
4,5,58187.16,0.273099,0.415433,USA,3,0,NaN,NaN

In [31]:
# Merge combined dataframe with male_df

merged_df = pd.merge(merged_df, male_df, on='STUDENT_ID', how='left')
merged_df.head()

,STUDENT_ID,Family_Income,Credit_Score_Raw,Credit_Score_AgeAdj,Country,Region,Married,enlist,Unemployed,Male
0,1,109770.95,0.495227,0.767967,USA,2,1,NaN,NaN,True
1,2,58442.99,0.987649,0.529815,USA,5,0,NaN,NaN,NaN
2,3,97125.87,0.249315,0.589539,USA,2,1,NaN,NaN,True
3,4,55256.40,0.653183,0.805702,USA,1,0,marines,NaN,True
4,5,58187.16,0.273099,0.415433,USA,3,0,NaN,NaN,NaN

In [32]:
# Merge combined dataframe with personality_characteristics

merged_df = pd.merge(merged_df, personality_characteristics, on='STUDENT_ID', how='left')
merged_df.head()

,STUDENT_ID,Family_Income,Credit_Score_Raw,Credit_Score_AgeAdj,Country,Region,Married,enlist,Unemployed,Male,LongTermPlannerScore,DecisionStyle,PowerOrientedScore,CommunityOrientedScore
0,1,109770.95,0.495227,0.767967,USA,2,1,NaN,NaN,True,0.956004,Emotional,0.767967,0.189491
1,2,58442.99,0.987649,0.529815,USA,5,0,NaN,NaN,NaN,0.601589,Analytical,1.000000,0.529815
2,3,97125.87,0.249315,0.589539,USA,2,1,NaN,NaN,True,0.655254,Emotional,0.589539,0.589539
3,4,55256.40,0.653183,0.805702,USA,1,0,marines,NaN,True,0.841278,Emotional,0.805702,0.061538
4,5,58187.16,0.273099,0.415433,USA,3,0,NaN,NaN,NaN,0.738851,Emotional,0.415433,0.241257

In [33]:
# Merge combined dataframe with disabled_df

merged_df = pd.merge(merged_df, disabled_df, on='STUDENT_ID', how='left')
merged_df.head()

,STUDENT_ID,Family_Income,Credit_Score_Raw,Credit_Score_AgeAdj,Country,Region,Married,enlist,Unemployed,Male,LongTermPlannerScore,DecisionStyle,PowerOrientedScore,CommunityOrientedScore,Disabled
0,1,109770.95,0.495227,0.767967,USA,2,1,NaN,NaN,True,0.956004,Emotional,0.767967,0.189491,NaN
1,2,58442.99,0.987649,0.529815,USA,5,0,NaN,NaN,NaN,0.601589,Analytical,1.000000,0.529815,NaN
2,3,97125.87,0.249315,0.589539,USA,2,1,NaN,NaN,True,0.655254,Emotional,0.589539,0.589539,NaN
3,4,55256.40,0.653183,0.805702,USA,1,0,marines,NaN,True,0.841278,Emotional,0.805702,0.061538,NaN
4,5,58187.16,0.273099,0.415433,USA,3,0,NaN,NaN,NaN,0.738851,Emotional,0.415433,0.241257,NaN

In [34]:
# Merge combined dataframe with parents_education

merged_df = pd.merge(merged_df, parents_education, on='STUDENT_ID', how='left')
merged_df.head()

,STUDENT_ID,Family_Income,Credit_Score_Raw,Credit_Score_AgeAdj,Country,Region,Married,enlist,Unemployed,Male,LongTermPlannerScore,DecisionStyle,PowerOrientedScore,CommunityOrientedScore,Disabled,PARENTS_EDUCATION_LEVEL
0,1,109770.95,0.495227,0.767967,USA,2,1,NaN,NaN,True,0.956004,Emotional,0.767967,0.189491,NaN,Bachelor's
1,2,58442.99,0.987649,0.529815,USA,5,0,NaN,NaN,NaN,0.601589,Analytical,1.000000,0.529815,NaN,Doctorate
2,3,97125.87,0.249315,0.589539,USA,2,1,NaN,NaN,True,0.655254,Emotional,0.589539,0.589539,NaN,HS or Lower
3,4,55256.40,0.653183,0.805702,USA,1,0,marines,NaN,True,0.841278,Emotional,0.805702,0.061538,NaN,Master's
4,5,58187.16,0.273099,0.415433,USA,3,0,NaN,NaN,NaN,0.738851,Emotional,0.415433,0.241257,NaN,Master's

In [35]:
# Merge combined dataframe with hs_academics

merged_df = pd.merge(merged_df, hs_academics, on='STUDENT_ID', how='left')
merged_df.head()

,STUDENT_ID,Family_Income,Credit_Score_Raw,Credit_Score_AgeAdj,Country,Region,Married,enlist,Unemployed,Male,LongTermPlannerScore,DecisionStyle,PowerOrientedScore,CommunityOrientedScore,Disabled,PARENTS_EDUCATION_LEVEL,HS_Math,HS_Science,HS_English
0,1,109770.95,0.495227,0.767967,USA,2,1,NaN,NaN,True,0.956004,Emotional,0.767967,0.189491,NaN,Bachelor's,10,10,10.0
1,2,58442.99,0.987649,0.529815,USA,5,0,NaN,NaN,NaN,0.601589,Analytical,1.000000,0.529815,NaN,Doctorate,9,9,10.0
2,3,97125.87,0.249315,0.589539,USA,2,1,NaN,NaN,True,0.655254,Emotional,0.589539,0.589539,NaN,HS or Lower,9,6,6.0
3,4,55256.40,0.653183,0.805702,USA,1,0,marines,NaN,True,0.841278,Emotional,0.805702,0.061538,NaN,Master's,10,9,9.0
4,5,58187.16,0.273099,0.415433,USA,3,0,NaN,NaN,NaN,0.738851,Emotional,0.415433,0.241257,NaN,Master's,6,8,5.0

In [36]:
# Merge combined dataframe with enrolled_df

merged_df = pd.merge(merged_df, enrolled_df, on='STUDENT_ID', how='left')
merged_df.head()

,STUDENT_ID,Family_Income,Credit_Score_Raw,Credit_Score_AgeAdj,Country,Region,Married,enlist,Unemployed,Male,LongTermPlannerScore,DecisionStyle,PowerOrientedScore,CommunityOrientedScore,Disabled,PARENTS_EDUCATION_LEVEL,HS_Math,HS_Science,HS_English,School,Course Units
0,1,109770.95,0.495227,0.767967,USA,2,1,NaN,NaN,True,0.956004,Emotional,0.767967,0.189491,NaN,Bachelor's,10,10,10.0,occ,11
1,2,58442.99,0.987649,0.529815,USA,5,0,NaN,NaN,NaN,0.601589,Analytical,1.000000,0.529815,NaN,Doctorate,9,9,10.0,uci,11
2,3,97125.87,0.249315,0.589539,USA,2,1,NaN,NaN,True,0.655254,Emotional,0.589539,0.589539,NaN,HS or Lower,9,6,6.0,occ,1
3,4,55256.40,0.653183,0.805702,USA,1,0,marines,NaN,True,0.841278,Emotional,0.805702,0.061538,NaN,Master's,10,9,9.0,uci,6
4,5,58187.16,0.273099,0.415433,USA,3,0,NaN,NaN,NaN,0.738851,Emotional,0.415433,0.241257,NaN,Master's,6,8,5.0,smc,5

In [37]:
# Merge combined dataframe with longest_absence_from_school_df

merged_df = pd.merge(merged_df, longest_absence_from_school_df, on='STUDENT_ID', how='left')
merged_df.head()

,STUDENT_ID,Family_Income,Credit_Score_Raw,Credit_Score_AgeAdj,Country,Region,Married,enlist,Unemployed,Male,LongTermPlannerScore,DecisionStyle,PowerOrientedScore,CommunityOrientedScore,Disabled,PARENTS_EDUCATION_LEVEL,HS_Math,HS_Science,HS_English,School,Course Units,longest_absense_from_school
0,1,109770.95,0.495227,0.767967,USA,2,1,NaN,NaN,True,0.956004,Emotional,0.767967,0.189491,NaN,Bachelor's,10,10,10.0,occ,11,1
1,2,58442.99,0.987649,0.529815,USA,5,0,NaN,NaN,NaN,0.601589,Analytical,1.000000,0.529815,NaN,Doctorate,9,9,10.0,uci,11,6
2,3,97125.87,0.249315,0.589539,USA,2,1,NaN,NaN,True,0.655254,Emotional,0.589539,0.589539,NaN,HS or Lower,9,6,6.0,occ,1,4
3,4,55256.40,0.653183,0.805702,USA,1,0,marines,NaN,True,0.841278,Emotional,0.805702,0.061538,NaN,Master's,10,9,9.0,uci,6,5
4,5,58187.16,0.273099,0.415433,USA,3,0,NaN,NaN,NaN,0.738851,Emotional,0.415433,0.241257,NaN,Master's,6,8,5.0,smc,5,2

In [38]:
# Merge combined dataframe with bankruptcy_df

merged_df = pd.merge(merged_df, bankruptcy_df, on='STUDENT_ID', how='left')
merged_df.head()

,STUDENT_ID,Family_Income,Credit_Score_Raw,Credit_Score_AgeAdj,Country,Region,Married,enlist,Unemployed,Male,LongTermPlannerScore,DecisionStyle,PowerOrientedScore,CommunityOrientedScore,Disabled,PARENTS_EDUCATION_LEVEL,HS_Math,HS_Science,HS_English,School,Course Units,longest_absense_from_school,Bankrupted
0,1,109770.95,0.495227,0.767967,USA,2,1,NaN,NaN,True,0.956004,Emotional,0.767967,0.189491,NaN,Bachelor's,10,10,10.0,occ,11,1,NaN
1,2,58442.99,0.987649,0.529815,USA,5,0,NaN,NaN,NaN,0.601589,Analytical,1.000000,0.529815,NaN,Doctorate,9,9,10.0,uci,11,6,True
2,3,97125.87,0.249315,0.589539,USA,2,1,NaN,NaN,True,0.655254,Emotional,0.589539,0.589539,NaN,HS or Lower,9,6,6.0,occ,1,4,NaN
3,4,55256.40,0.653183,0.805702,USA,1,0,marines,NaN,True,0.841278,Emotional,0.805702,0.061538,NaN,Master's,10,9,9.0,uci,6,5,NaN
4,5,58187.16,0.273099,0.415433,USA,3,0,NaN,NaN,NaN,0.738851,Emotional,0.415433,0.241257,NaN,Master's,6,8,5.0,smc,5,2,NaN

In [39]:
# Merge combined dataframe with loan_amount

merged_df = pd.merge(merged_df, loan_amount, on='STUDENT_ID', how='left')
merged_df.head()

,STUDENT_ID,Family_Income,Credit_Score_Raw,Credit_Score_AgeAdj,Country,Region,Married,enlist,Unemployed,Male,LongTermPlannerScore,DecisionStyle,PowerOrientedScore,CommunityOrientedScore,Disabled,PARENTS_EDUCATION_LEVEL,HS_Math,HS_Science,HS_English,School,Course Units,longest_absense_from_school,Bankrupted,Loan_Amount
0,1,109770.95,0.495227,0.767967,USA,2,1,NaN,NaN,True,0.956004,Emotional,0.767967,0.189491,NaN,Bachelor's,10,10,10.0,occ,11,1,NaN,19861
1,2,58442.99,0.987649,0.529815,USA,5,0,NaN,NaN,NaN,0.601589,Analytical,1.000000,0.529815,NaN,Doctorate,9,9,10.0,uci,11,6,True,17391
2,3,97125.87,0.249315,0.589539,USA,2,1,NaN,NaN,True,0.655254,Emotional,0.589539,0.589539,NaN,HS or Lower,9,6,6.0,occ,1,4,NaN,8118
3,4,55256.40,0.653183,0.805702,USA,1,0,marines,NaN,True,0.841278,Emotional,0.805702,0.061538,NaN,Master's,10,9,9.0,uci,6,5,NaN,18905
4,5,58187.16,0.273099,0.415433,USA,3,0,NaN,NaN,NaN,0.738851,Emotional,0.415433,0.241257,NaN,Master's,6,8,5.0,smc,5,2,NaN,16175

In [40]:
# Merge combined dataframe with nopaymentdue

merged_df = pd.merge(merged_df, nopaymentdue, on='STUDENT_ID', how='left')
merged_df.head()

,STUDENT_ID,Family_Income,Credit_Score_Raw,Credit_Score_AgeAdj,Country,Region,Married,enlist,Unemployed,Male,LongTermPlannerScore,DecisionStyle,PowerOrientedScore,CommunityOrientedScore,Disabled,PARENTS_EDUCATION_LEVEL,HS_Math,HS_Science,HS_English,School,Course Units,longest_absense_from_school,Bankrupted,Loan_Amount,no_payment_due
0,1,109770.95,0.495227,0.767967,USA,2,1,NaN,NaN,True,0.956004,Emotional,0.767967,0.189491,NaN,Bachelor's,10,10,10.0,occ,11,1,NaN,19861,pos
1,2,58442.99,0.987649,0.529815,USA,5,0,NaN,NaN,NaN,0.601589,Analytical,1.000000,0.529815,NaN,Doctorate,9,9,10.0,uci,11,6,True,17391,pos
2,3,97125.87,0.249315,0.589539,USA,2,1,NaN,NaN,True,0.655254,Emotional,0.589539,0.589539,NaN,HS or Lower,9,6,6.0,occ,1,4,NaN,8118,neg
3,4,55256.40,0.653183,0.805702,USA,1,0,marines,NaN,True,0.841278,Emotional,0.805702,0.061538,NaN,Master's,10,9,9.0,uci,6,5,NaN,18905,pos
4,5,58187.16,0.273099,0.415433,USA,3,0,NaN,NaN,NaN,0.738851,Emotional,0.415433,0.241257,NaN,Master's,6,8,5.0,smc,5,2,NaN,16175,neg